#+TITLE: Emacs Configuration
#+AUTHOR: Denis Tranchemontagne
#+Email: dtranche@gmail.com

The idea is taken from a series of videos including
[[https://www.youtube.com/watch?v=VIuOwIBL-ZU]]
[[https://www.youtube.com/watch?v=gRb3bq0NiXY&feature=youtu.be]]

use-package is described here [[https://github.com/jwiegley/use-package]]

I've taken liberally from lots of sources on the web.  I may try to link some more
here.

(\C-c ') -- for org babel

* Custom Functions
#+begin_src emacs-lisp
	(defun match-paren (arg)
		 "Go to the matching paren if on a paren; otherwise insert %."
		 (interactive "p")
			 (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
						 ((looking-at "\\s\)") (forward-char 1) (backward-list 1))
						 (t (self-insert-command (or arg 1)))))

	(defun prada ()
		 (interactive)
		 (find-file "/ssh:denist@prada:/home/denist/working_dir"))

	(defun get-point ( symbol &optional arg )
		"get the point"
		(funcall symbol arg )
		(point)
		)

	(defun copy-thing ( begin-of-thing end-of-thing &optional arg )
		"copy thing between beg & end into kill ring"
		(save-excursion
			(let ((beg (get-point begin-of-thing 1))
						(end (get-point end-of-thing arg)))
				(copy-region-as-kill beg end)))
		)

	(defun copy-word (&optional arg)
		"Copy words at point into kill-ring"
		(interactive "P")
		(copy-thing 'backward-word 'forward-word arg)
		)

	;;(global-set-key (kbd "C-b") 'copy-word)

	(require 'ansi-color)
	(defun my/ansi-colorize-buffer ()
		(let ((buffer-read-only nil))
			(ansi-color-apply-on-region (point-min) (point-max))))

	(defun my/buffer-file-name ()
		(interactive)
		(message (buffer-file-name)))

	(defun my/mark-line()
		(interactive)
		(push-mark)
		(push-mark))
#+end_src

better move to beginning of line
#+BEGIN_SRC emacs-lisp
  (defun smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

    Move point to the first non-whitespace character on this line.
    If point is already there, move to the beginning of the line.
    Effectively toggle between the first non-whitespace character and
    the beginning of the line.

    If ARG is not nil or 1, move forward ARG - 1 lines first.  If
    point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
    (forward-line (1- arg))))

    (let ((orig-point (point)))
     (back-to-indentation)
     (when (= orig-point (point))
      (move-beginning-of-line 1))))

  (global-set-key [remap move-beginning-of-line]
                   'smarter-move-beginning-of-line)

#+END_SRC

remote shell
#+BEGIN_SRC emacs-lisp
  (defun remote-shell (&optional host)
    "Open a remote shell to a host."
    (interactive)
    (with-temp-buffer
      (let ((host (if host host (read-string "Host: "))))
        (cd (concat "/ssh:denist@" host ":"))
        (shell (concat "*" host "*")))))

  (defun prada-shell ()
    (interactive)
    (remote-shell "prada"))
#+END_SRC

align whitespace
#+BEGIN_SRC emacs-lisp
(defun align-whitespace (start end)
  "Align columns by whitespace"
  (interactive "r")
  (align-regexp start end
                "\\(\\s-*\\)\\s-" 1 0 t))
#+END_SRC


#+RESULTS:
: copy-word
:
